Microchip-MPLAB-Harmony/wireless_apps_pic32cxbz2_wbz45/apps/ieee_802_15_4/MAC/push_pull_mac_app/demoapp_ffd/firmware/src/packs/PIC32CX1012BZ25048_DFP/component/pfw.h
/*
 * Component description for PFW
 *
 * Copyright (c) 2023 Microchip Technology Inc. and its subsidiaries.
 *
 * Subject to your compliance with these terms, you may use Microchip software and any derivatives
 * exclusively with Microchip products. It is your responsibility to comply with third party license
 * terms applicable to your use of third party software (including open source software) that may
 * accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY,
 * APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND
 * FITNESS FOR A PARTICULAR PURPOSE.
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF
 * MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT
 * EXCEED THE AMOUNT OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 */

/* file generated from device description version 2023-05-31T11:02:56Z */
#ifndef _BZ25_PFW_COMPONENT_H_
#define _BZ25_PFW_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR PFW                                          */
/* ************************************************************************** */

/* -------- PFW_IFT_CON : (PFW Offset: 0x00) (R/W 32)  -------- */
#define PFW_IFT_CON_RESETVALUE                _UINT32_(0x00)                                       /*  (PFW_IFT_CON)   Reset Value */

#define PFW_IFT_CON_FRZ_Pos                   _UINT32_(13)                                         /* (PFW_IFT_CON)  Position */
#define PFW_IFT_CON_FRZ_Msk                   (_UINT32_(0x1) << PFW_IFT_CON_FRZ_Pos)               /* (PFW_IFT_CON)  Mask */
#define PFW_IFT_CON_FRZ(value)                (PFW_IFT_CON_FRZ_Msk & (_UINT32_(value) << PFW_IFT_CON_FRZ_Pos)) /* Assigment of value for FRZ in the PFW_IFT_CON register */
#define PFW_IFT_CON_SIDL_Pos                  _UINT32_(14)                                         /* (PFW_IFT_CON)  Position */
#define PFW_IFT_CON_SIDL_Msk                  (_UINT32_(0x1) << PFW_IFT_CON_SIDL_Pos)              /* (PFW_IFT_CON)  Mask */
#define PFW_IFT_CON_SIDL(value)               (PFW_IFT_CON_SIDL_Msk & (_UINT32_(value) << PFW_IFT_CON_SIDL_Pos)) /* Assigment of value for SIDL in the PFW_IFT_CON register */
#define PFW_IFT_CON_ON_Pos                    _UINT32_(15)                                         /* (PFW_IFT_CON)  Position */
#define PFW_IFT_CON_ON_Msk                    (_UINT32_(0x1) << PFW_IFT_CON_ON_Pos)                /* (PFW_IFT_CON)  Mask */
#define PFW_IFT_CON_ON(value)                 (PFW_IFT_CON_ON_Msk & (_UINT32_(value) << PFW_IFT_CON_ON_Pos)) /* Assigment of value for ON in the PFW_IFT_CON register */
#define PFW_IFT_CON_Msk                       _UINT32_(0x0000E000)                                 /* (PFW_IFT_CON) Register Mask  */


/* -------- PFW_IFT_CRCCON : (PFW Offset: 0x10) (R/W 32)  -------- */
#define PFW_IFT_CRCCON_RESETVALUE             _UINT32_(0x00)                                       /*  (PFW_IFT_CRCCON)   Reset Value */

#define PFW_IFT_CRCCON_AUTOR_Pos              _UINT32_(0)                                          /* (PFW_IFT_CRCCON)  Position */
#define PFW_IFT_CRCCON_AUTOR_Msk              (_UINT32_(0x1) << PFW_IFT_CRCCON_AUTOR_Pos)          /* (PFW_IFT_CRCCON)  Mask */
#define PFW_IFT_CRCCON_AUTOR(value)           (PFW_IFT_CRCCON_AUTOR_Msk & (_UINT32_(value) << PFW_IFT_CRCCON_AUTOR_Pos)) /* Assigment of value for AUTOR in the PFW_IFT_CRCCON register */
#define PFW_IFT_CRCCON_RBITO_Pos              _UINT32_(1)                                          /* (PFW_IFT_CRCCON)  Position */
#define PFW_IFT_CRCCON_RBITO_Msk              (_UINT32_(0x1) << PFW_IFT_CRCCON_RBITO_Pos)          /* (PFW_IFT_CRCCON)  Mask */
#define PFW_IFT_CRCCON_RBITO(value)           (PFW_IFT_CRCCON_RBITO_Msk & (_UINT32_(value) << PFW_IFT_CRCCON_RBITO_Pos)) /* Assigment of value for RBITO in the PFW_IFT_CRCCON register */
#define PFW_IFT_CRCCON_PAUSE_Pos              _UINT32_(2)                                          /* (PFW_IFT_CRCCON)  Position */
#define PFW_IFT_CRCCON_PAUSE_Msk              (_UINT32_(0x1) << PFW_IFT_CRCCON_PAUSE_Pos)          /* (PFW_IFT_CRCCON)  Mask */
#define PFW_IFT_CRCCON_PAUSE(value)           (PFW_IFT_CRCCON_PAUSE_Msk & (_UINT32_(value) << PFW_IFT_CRCCON_PAUSE_Pos)) /* Assigment of value for PAUSE in the PFW_IFT_CRCCON register */
#define PFW_IFT_CRCCON_PLEN32_Pos             _UINT32_(12)                                         /* (PFW_IFT_CRCCON)  Position */
#define PFW_IFT_CRCCON_PLEN32_Msk             (_UINT32_(0x1) << PFW_IFT_CRCCON_PLEN32_Pos)         /* (PFW_IFT_CRCCON)  Mask */
#define PFW_IFT_CRCCON_PLEN32(value)          (PFW_IFT_CRCCON_PLEN32_Msk & (_UINT32_(value) << PFW_IFT_CRCCON_PLEN32_Pos)) /* Assigment of value for PLEN32 in the PFW_IFT_CRCCON register */
#define PFW_IFT_CRCCON_ERROR_Pos              _UINT32_(13)                                         /* (PFW_IFT_CRCCON)  Position */
#define PFW_IFT_CRCCON_ERROR_Msk              (_UINT32_(0x1) << PFW_IFT_CRCCON_ERROR_Pos)          /* (PFW_IFT_CRCCON)  Mask */
#define PFW_IFT_CRCCON_ERROR(value)           (PFW_IFT_CRCCON_ERROR_Msk & (_UINT32_(value) << PFW_IFT_CRCCON_ERROR_Pos)) /* Assigment of value for ERROR in the PFW_IFT_CRCCON register */
#define PFW_IFT_CRCCON_DONE_Pos               _UINT32_(14)                                         /* (PFW_IFT_CRCCON)  Position */
#define PFW_IFT_CRCCON_DONE_Msk               (_UINT32_(0x1) << PFW_IFT_CRCCON_DONE_Pos)           /* (PFW_IFT_CRCCON)  Mask */
#define PFW_IFT_CRCCON_DONE(value)            (PFW_IFT_CRCCON_DONE_Msk & (_UINT32_(value) << PFW_IFT_CRCCON_DONE_Pos)) /* Assigment of value for DONE in the PFW_IFT_CRCCON register */
#define PFW_IFT_CRCCON_CRCEN_Pos              _UINT32_(15)                                         /* (PFW_IFT_CRCCON)  Position */
#define PFW_IFT_CRCCON_CRCEN_Msk              (_UINT32_(0x1) << PFW_IFT_CRCCON_CRCEN_Pos)          /* (PFW_IFT_CRCCON)  Mask */
#define PFW_IFT_CRCCON_CRCEN(value)           (PFW_IFT_CRCCON_CRCEN_Msk & (_UINT32_(value) << PFW_IFT_CRCCON_CRCEN_Pos)) /* Assigment of value for CRCEN in the PFW_IFT_CRCCON register */
#define PFW_IFT_CRCCON_PERIOD_Pos             _UINT32_(16)                                         /* (PFW_IFT_CRCCON)  Position */
#define PFW_IFT_CRCCON_PERIOD_Msk             (_UINT32_(0xFFFF) << PFW_IFT_CRCCON_PERIOD_Pos)      /* (PFW_IFT_CRCCON)  Mask */
#define PFW_IFT_CRCCON_PERIOD(value)          (PFW_IFT_CRCCON_PERIOD_Msk & (_UINT32_(value) << PFW_IFT_CRCCON_PERIOD_Pos)) /* Assigment of value for PERIOD in the PFW_IFT_CRCCON register */
#define PFW_IFT_CRCCON_Msk                    _UINT32_(0xFFFFF007)                                 /* (PFW_IFT_CRCCON) Register Mask  */

#define PFW_IFT_CRCCON_PLEN_Pos               _UINT32_(12)                                         /* (PFW_IFT_CRCCON Position)  */
#define PFW_IFT_CRCCON_PLEN_Msk               (_UINT32_(0x1) << PFW_IFT_CRCCON_PLEN_Pos)           /* (PFW_IFT_CRCCON Mask) PLEN */
#define PFW_IFT_CRCCON_PLEN(value)            (PFW_IFT_CRCCON_PLEN_Msk & (_UINT32_(value) << PFW_IFT_CRCCON_PLEN_Pos)) 

