Microchip-MPLAB-Harmony/wireless_apps_pic32cxbz2_wbz45/apps/ieee_802_15_4/MAC/push_pull_mac_app/demoapp_ffd/firmware/src/packs/PIC32CX1012BZ25048_DFP/component/pfw.h
/* -------- PFW_IFT_CRCMADR : (PFW Offset: 0x20) (R/W 32)  -------- */
#define PFW_IFT_CRCMADR_RESETVALUE            _UINT32_(0x00)                                       /*  (PFW_IFT_CRCMADR)   Reset Value */

#define PFW_IFT_CRCMADR_IFT_CRCMADR_Pos       _UINT32_(0)                                          /* (PFW_IFT_CRCMADR)  Position */
#define PFW_IFT_CRCMADR_IFT_CRCMADR_Msk       (_UINT32_(0xFFFFFFFF) << PFW_IFT_CRCMADR_IFT_CRCMADR_Pos) /* (PFW_IFT_CRCMADR)  Mask */
#define PFW_IFT_CRCMADR_IFT_CRCMADR(value)    (PFW_IFT_CRCMADR_IFT_CRCMADR_Msk & (_UINT32_(value) << PFW_IFT_CRCMADR_IFT_CRCMADR_Pos)) /* Assigment of value for IFT_CRCMADR in the PFW_IFT_CRCMADR register */
#define PFW_IFT_CRCMADR_Msk                   _UINT32_(0xFFFFFFFF)                                 /* (PFW_IFT_CRCMADR) Register Mask  */


/* -------- PFW_IFT_CRCMLEN : (PFW Offset: 0x30) (R/W 32)  -------- */
#define PFW_IFT_CRCMLEN_RESETVALUE            _UINT32_(0x00)                                       /*  (PFW_IFT_CRCMLEN)   Reset Value */

#define PFW_IFT_CRCMLEN_CRCMLEN_Pos           _UINT32_(0)                                          /* (PFW_IFT_CRCMLEN)  Position */
#define PFW_IFT_CRCMLEN_CRCMLEN_Msk           (_UINT32_(0xFFFFFF) << PFW_IFT_CRCMLEN_CRCMLEN_Pos)  /* (PFW_IFT_CRCMLEN)  Mask */
#define PFW_IFT_CRCMLEN_CRCMLEN(value)        (PFW_IFT_CRCMLEN_CRCMLEN_Msk & (_UINT32_(value) << PFW_IFT_CRCMLEN_CRCMLEN_Pos)) /* Assigment of value for CRCMLEN in the PFW_IFT_CRCMLEN register */
#define PFW_IFT_CRCMLEN_Msk                   _UINT32_(0x00FFFFFF)                                 /* (PFW_IFT_CRCMLEN) Register Mask  */


/* -------- PFW_IFT_CRCIV : (PFW Offset: 0x40) (R/W 32)  -------- */
#define PFW_IFT_CRCIV_RESETVALUE              _UINT32_(0x00)                                       /*  (PFW_IFT_CRCIV)   Reset Value */

#define PFW_IFT_CRCIV_CRCIV_Pos               _UINT32_(0)                                          /* (PFW_IFT_CRCIV)  Position */
#define PFW_IFT_CRCIV_CRCIV_Msk               (_UINT32_(0xFFFFFFFF) << PFW_IFT_CRCIV_CRCIV_Pos)    /* (PFW_IFT_CRCIV)  Mask */
#define PFW_IFT_CRCIV_CRCIV(value)            (PFW_IFT_CRCIV_CRCIV_Msk & (_UINT32_(value) << PFW_IFT_CRCIV_CRCIV_Pos)) /* Assigment of value for CRCIV in the PFW_IFT_CRCIV register */
#define PFW_IFT_CRCIV_Msk                     _UINT32_(0xFFFFFFFF)                                 /* (PFW_IFT_CRCIV) Register Mask  */


/* -------- PFW_IFT_CRCACC : (PFW Offset: 0x50) (R/W 32)  -------- */
#define PFW_IFT_CRCACC_RESETVALUE             _UINT32_(0x00)                                       /*  (PFW_IFT_CRCACC)   Reset Value */

#define PFW_IFT_CRCACC_CRCACC_Pos             _UINT32_(0)                                          /* (PFW_IFT_CRCACC)  Position */
#define PFW_IFT_CRCACC_CRCACC_Msk             (_UINT32_(0xFFFFFFFF) << PFW_IFT_CRCACC_CRCACC_Pos)  /* (PFW_IFT_CRCACC)  Mask */
#define PFW_IFT_CRCACC_CRCACC(value)          (PFW_IFT_CRCACC_CRCACC_Msk & (_UINT32_(value) << PFW_IFT_CRCACC_CRCACC_Pos)) /* Assigment of value for CRCACC in the PFW_IFT_CRCACC register */
#define PFW_IFT_CRCACC_Msk                    _UINT32_(0xFFFFFFFF)                                 /* (PFW_IFT_CRCACC) Register Mask  */


/* -------- PFW_IFT_CRCPOLY : (PFW Offset: 0x60) (R/W 32)  -------- */
#define PFW_IFT_CRCPOLY_RESETVALUE            _UINT32_(0x00)                                       /*  (PFW_IFT_CRCPOLY)   Reset Value */

#define PFW_IFT_CRCPOLY_CYCPOLY_Pos           _UINT32_(0)                                          /* (PFW_IFT_CRCPOLY)  Position */
#define PFW_IFT_CRCPOLY_CYCPOLY_Msk           (_UINT32_(0xFFFFFFFF) << PFW_IFT_CRCPOLY_CYCPOLY_Pos) /* (PFW_IFT_CRCPOLY)  Mask */
#define PFW_IFT_CRCPOLY_CYCPOLY(value)        (PFW_IFT_CRCPOLY_CYCPOLY_Msk & (_UINT32_(value) << PFW_IFT_CRCPOLY_CYCPOLY_Pos)) /* Assigment of value for CYCPOLY in the PFW_IFT_CRCPOLY register */
#define PFW_IFT_CRCPOLY_Msk                   _UINT32_(0xFFFFFFFF)                                 /* (PFW_IFT_CRCPOLY) Register Mask  */


/* -------- PFW_IFT_CRCFXOR : (PFW Offset: 0x70) (R/W 32)  -------- */
#define PFW_IFT_CRCFXOR_RESETVALUE            _UINT32_(0x00)                                       /*  (PFW_IFT_CRCFXOR)   Reset Value */

#define PFW_IFT_CRCFXOR_CRCFXOR_Pos           _UINT32_(0)                                          /* (PFW_IFT_CRCFXOR)  Position */
#define PFW_IFT_CRCFXOR_CRCFXOR_Msk           (_UINT32_(0xFFFFFFFF) << PFW_IFT_CRCFXOR_CRCFXOR_Pos) /* (PFW_IFT_CRCFXOR)  Mask */
#define PFW_IFT_CRCFXOR_CRCFXOR(value)        (PFW_IFT_CRCFXOR_CRCFXOR_Msk & (_UINT32_(value) << PFW_IFT_CRCFXOR_CRCFXOR_Pos)) /* Assigment of value for CRCFXOR in the PFW_IFT_CRCFXOR register */
#define PFW_IFT_CRCFXOR_Msk                   _UINT32_(0xFFFFFFFF)                                 /* (PFW_IFT_CRCFXOR) Register Mask  */


/* -------- PFW_IFT_CRCSUM : (PFW Offset: 0x80) (R/W 32)  -------- */
#define PFW_IFT_CRCSUM_RESETVALUE             _UINT32_(0x00)                                       /*  (PFW_IFT_CRCSUM)   Reset Value */

#define PFW_IFT_CRCSUM_CRCSUM_Pos             _UINT32_(0)                                          /* (PFW_IFT_CRCSUM)  Position */
#define PFW_IFT_CRCSUM_CRCSUM_Msk             (_UINT32_(0xFFFFFFFF) << PFW_IFT_CRCSUM_CRCSUM_Pos)  /* (PFW_IFT_CRCSUM)  Mask */
#define PFW_IFT_CRCSUM_CRCSUM(value)          (PFW_IFT_CRCSUM_CRCSUM_Msk & (_UINT32_(value) << PFW_IFT_CRCSUM_CRCSUM_Pos)) /* Assigment of value for CRCSUM in the PFW_IFT_CRCSUM register */
#define PFW_IFT_CRCSUM_Msk                    _UINT32_(0xFFFFFFFF)                                 /* (PFW_IFT_CRCSUM) Register Mask  */


/* -------- PFW_IFT_ECCCON : (PFW Offset: 0x90) (R/W 32)  -------- */
#define PFW_IFT_ECCCON_RESETVALUE             _UINT32_(0x00)                                       /*  (PFW_IFT_ECCCON)   Reset Value */

#define PFW_IFT_ECCCON_FLT_MD_Pos             _UINT32_(0)                                          /* (PFW_IFT_ECCCON)  Position */
#define PFW_IFT_ECCCON_FLT_MD_Msk             (_UINT32_(0x7) << PFW_IFT_ECCCON_FLT_MD_Pos)         /* (PFW_IFT_ECCCON)  Mask */
#define PFW_IFT_ECCCON_FLT_MD(value)          (PFW_IFT_ECCCON_FLT_MD_Msk & (_UINT32_(value) << PFW_IFT_ECCCON_FLT_MD_Pos)) /* Assigment of value for FLT_MD in the PFW_IFT_ECCCON register */
#define PFW_IFT_ECCCON_EVENT_Pos              _UINT32_(7)                                          /* (PFW_IFT_ECCCON)  Position */
#define PFW_IFT_ECCCON_EVENT_Msk              (_UINT32_(0x1) << PFW_IFT_ECCCON_EVENT_Pos)          /* (PFW_IFT_ECCCON)  Mask */
#define PFW_IFT_ECCCON_EVENT(value)           (PFW_IFT_ECCCON_EVENT_Msk & (_UINT32_(value) << PFW_IFT_ECCCON_EVENT_Pos)) /* Assigment of value for EVENT in the PFW_IFT_ECCCON register */
#define PFW_IFT_ECCCON_CTLFLT_Pos             _UINT32_(8)                                          /* (PFW_IFT_ECCCON)  Position */
#define PFW_IFT_ECCCON_CTLFLT_Msk             (_UINT32_(0x7) << PFW_IFT_ECCCON_CTLFLT_Pos)         /* (PFW_IFT_ECCCON)  Mask */
#define PFW_IFT_ECCCON_CTLFLT(value)          (PFW_IFT_ECCCON_CTLFLT_Msk & (_UINT32_(value) << PFW_IFT_ECCCON_CTLFLT_Pos)) /* Assigment of value for CTLFLT in the PFW_IFT_ECCCON register */
#define PFW_IFT_ECCCON_FLTEN_Pos              _UINT32_(15)                                         /* (PFW_IFT_ECCCON)  Position */
#define PFW_IFT_ECCCON_FLTEN_Msk              (_UINT32_(0x1) << PFW_IFT_ECCCON_FLTEN_Pos)          /* (PFW_IFT_ECCCON)  Mask */
#define PFW_IFT_ECCCON_FLTEN(value)           (PFW_IFT_ECCCON_FLTEN_Msk & (_UINT32_(value) << PFW_IFT_ECCCON_FLTEN_Pos)) /* Assigment of value for FLTEN in the PFW_IFT_ECCCON register */
#define PFW_IFT_ECCCON_Msk                    _UINT32_(0x00008787)                                 /* (PFW_IFT_ECCCON) Register Mask  */


/* -------- PFW_IFT_ECCFLT : (PFW Offset: 0xA0) (R/W 32)  -------- */
#define PFW_IFT_ECCFLT_RESETVALUE             _UINT32_(0x00)                                       /*  (PFW_IFT_ECCFLT)   Reset Value */

#define PFW_IFT_ECCFLT_FLT1PTR_Pos            _UINT32_(0)                                          /* (PFW_IFT_ECCFLT)  Position */
#define PFW_IFT_ECCFLT_FLT1PTR_Msk            (_UINT32_(0x1FF) << PFW_IFT_ECCFLT_FLT1PTR_Pos)      /* (PFW_IFT_ECCFLT)  Mask */
#define PFW_IFT_ECCFLT_FLT1PTR(value)         (PFW_IFT_ECCFLT_FLT1PTR_Msk & (_UINT32_(value) << PFW_IFT_ECCFLT_FLT1PTR_Pos)) /* Assigment of value for FLT1PTR in the PFW_IFT_ECCFLT register */
#define PFW_IFT_ECCFLT_FLT2PTR_Pos            _UINT32_(16)                                         /* (PFW_IFT_ECCFLT)  Position */
#define PFW_IFT_ECCFLT_FLT2PTR_Msk            (_UINT32_(0x1FF) << PFW_IFT_ECCFLT_FLT2PTR_Pos)      /* (PFW_IFT_ECCFLT)  Mask */
#define PFW_IFT_ECCFLT_FLT2PTR(value)         (PFW_IFT_ECCFLT_FLT2PTR_Msk & (_UINT32_(value) << PFW_IFT_ECCFLT_FLT2PTR_Pos)) /* Assigment of value for FLT2PTR in the PFW_IFT_ECCFLT register */
#define PFW_IFT_ECCFLT_Msk                    _UINT32_(0x01FF01FF)                                 /* (PFW_IFT_ECCFLT) Register Mask  */


/* -------- PFW_IFT_ECCADR : (PFW Offset: 0xB0) (R/W 32)  -------- */
#define PFW_IFT_ECCADR_RESETVALUE             _UINT32_(0x00)                                       /*  (PFW_IFT_ECCADR)   Reset Value */

#define PFW_IFT_ECCADR_ECCADR_Pos             _UINT32_(0)                                          /* (PFW_IFT_ECCADR)  Position */
#define PFW_IFT_ECCADR_ECCADR_Msk             (_UINT32_(0xFFFFFFFF) << PFW_IFT_ECCADR_ECCADR_Pos)  /* (PFW_IFT_ECCADR)  Mask */
#define PFW_IFT_ECCADR_ECCADR(value)          (PFW_IFT_ECCADR_ECCADR_Msk & (_UINT32_(value) << PFW_IFT_ECCADR_ECCADR_Pos)) /* Assigment of value for ECCADR in the PFW_IFT_ECCADR register */
#define PFW_IFT_ECCADR_Msk                    _UINT32_(0xFFFFFFFF)                                 /* (PFW_IFT_ECCADR) Register Mask  */


/* -------- PFW_IFT_ECCPAR : (PFW Offset: 0xC0) (R/W 32)  -------- */
#define PFW_IFT_ECCPAR_RESETVALUE             _UINT32_(0x00)                                       /*  (PFW_IFT_ECCPAR)   Reset Value */

#define PFW_IFT_ECCPAR_SECIN_Pos              _UINT32_(0)                                          /* (PFW_IFT_ECCPAR)  Position */
#define PFW_IFT_ECCPAR_SECIN_Msk              (_UINT32_(0x1FF) << PFW_IFT_ECCPAR_SECIN_Pos)        /* (PFW_IFT_ECCPAR)  Mask */
#define PFW_IFT_ECCPAR_SECIN(value)           (PFW_IFT_ECCPAR_SECIN_Msk & (_UINT32_(value) << PFW_IFT_ECCPAR_SECIN_Pos)) /* Assigment of value for SECIN in the PFW_IFT_ECCPAR register */
#define PFW_IFT_ECCPAR_DEDIN_Pos              _UINT32_(15)                                         /* (PFW_IFT_ECCPAR)  Position */
#define PFW_IFT_ECCPAR_DEDIN_Msk              (_UINT32_(0x1) << PFW_IFT_ECCPAR_DEDIN_Pos)          /* (PFW_IFT_ECCPAR)  Mask */
#define PFW_IFT_ECCPAR_DEDIN(value)           (PFW_IFT_ECCPAR_DEDIN_Msk & (_UINT32_(value) << PFW_IFT_ECCPAR_DEDIN_Pos)) /* Assigment of value for DEDIN in the PFW_IFT_ECCPAR register */
#define PFW_IFT_ECCPAR_SECOUT_Pos             _UINT32_(16)                                         /* (PFW_IFT_ECCPAR)  Position */
#define PFW_IFT_ECCPAR_SECOUT_Msk             (_UINT32_(0x1FF) << PFW_IFT_ECCPAR_SECOUT_Pos)       /* (PFW_IFT_ECCPAR)  Mask */
#define PFW_IFT_ECCPAR_SECOUT(value)          (PFW_IFT_ECCPAR_SECOUT_Msk & (_UINT32_(value) << PFW_IFT_ECCPAR_SECOUT_Pos)) /* Assigment of value for SECOUT in the PFW_IFT_ECCPAR register */
#define PFW_IFT_ECCPAR_DEDOUT_Pos             _UINT32_(31)                                         /* (PFW_IFT_ECCPAR)  Position */
#define PFW_IFT_ECCPAR_DEDOUT_Msk             (_UINT32_(0x1) << PFW_IFT_ECCPAR_DEDOUT_Pos)         /* (PFW_IFT_ECCPAR)  Mask */
#define PFW_IFT_ECCPAR_DEDOUT(value)          (PFW_IFT_ECCPAR_DEDOUT_Msk & (_UINT32_(value) << PFW_IFT_ECCPAR_DEDOUT_Pos)) /* Assigment of value for DEDOUT in the PFW_IFT_ECCPAR register */
#define PFW_IFT_ECCPAR_Msk                    _UINT32_(0x81FF81FF)                                 /* (PFW_IFT_ECCPAR) Register Mask  */


/* -------- PFW_IFT_ECCSYN : (PFW Offset: 0xD0) (R/W 32)  -------- */
#define PFW_IFT_ECCSYN_RESETVALUE             _UINT32_(0x00)                                       /*  (PFW_IFT_ECCSYN)   Reset Value */

#define PFW_IFT_ECCSYN_SECSYN_Pos             _UINT32_(0)                                          /* (PFW_IFT_ECCSYN)  Position */
#define PFW_IFT_ECCSYN_SECSYN_Msk             (_UINT32_(0x1FF) << PFW_IFT_ECCSYN_SECSYN_Pos)       /* (PFW_IFT_ECCSYN)  Mask */
#define PFW_IFT_ECCSYN_SECSYN(value)          (PFW_IFT_ECCSYN_SECSYN_Msk & (_UINT32_(value) << PFW_IFT_ECCSYN_SECSYN_Pos)) /* Assigment of value for SECSYN in the PFW_IFT_ECCSYN register */
#define PFW_IFT_ECCSYN_DEDSYS_Pos             _UINT32_(15)                                         /* (PFW_IFT_ECCSYN)  Position */
#define PFW_IFT_ECCSYN_DEDSYS_Msk             (_UINT32_(0x1) << PFW_IFT_ECCSYN_DEDSYS_Pos)         /* (PFW_IFT_ECCSYN)  Mask */
#define PFW_IFT_ECCSYN_DEDSYS(value)          (PFW_IFT_ECCSYN_DEDSYS_Msk & (_UINT32_(value) << PFW_IFT_ECCSYN_DEDSYS_Pos)) /* Assigment of value for DEDSYS in the PFW_IFT_ECCSYN register */
#define PFW_IFT_ECCSYN_SERR_Pos               _UINT32_(16)                                         /* (PFW_IFT_ECCSYN)  Position */
#define PFW_IFT_ECCSYN_SERR_Msk               (_UINT32_(0x1) << PFW_IFT_ECCSYN_SERR_Pos)           /* (PFW_IFT_ECCSYN)  Mask */
#define PFW_IFT_ECCSYN_SERR(value)            (PFW_IFT_ECCSYN_SERR_Msk & (_UINT32_(value) << PFW_IFT_ECCSYN_SERR_Pos)) /* Assigment of value for SERR in the PFW_IFT_ECCSYN register */
#define PFW_IFT_ECCSYN_DERR_Pos               _UINT32_(17)                                         /* (PFW_IFT_ECCSYN)  Position */
#define PFW_IFT_ECCSYN_DERR_Msk               (_UINT32_(0x1) << PFW_IFT_ECCSYN_DERR_Pos)           /* (PFW_IFT_ECCSYN)  Mask */
#define PFW_IFT_ECCSYN_DERR(value)            (PFW_IFT_ECCSYN_DERR_Msk & (_UINT32_(value) << PFW_IFT_ECCSYN_DERR_Pos)) /* Assigment of value for DERR in the PFW_IFT_ECCSYN register */
#define PFW_IFT_ECCSYN_CERR_Pos               _UINT32_(18)                                         /* (PFW_IFT_ECCSYN)  Position */
#define PFW_IFT_ECCSYN_CERR_Msk               (_UINT32_(0x1) << PFW_IFT_ECCSYN_CERR_Pos)           /* (PFW_IFT_ECCSYN)  Mask */
#define PFW_IFT_ECCSYN_CERR(value)            (PFW_IFT_ECCSYN_CERR_Msk & (_UINT32_(value) << PFW_IFT_ECCSYN_CERR_Pos)) /* Assigment of value for CERR in the PFW_IFT_ECCSYN register */
#define PFW_IFT_ECCSYN_CTLSTAT_Pos            _UINT32_(24)                                         /* (PFW_IFT_ECCSYN)  Position */
#define PFW_IFT_ECCSYN_CTLSTAT_Msk            (_UINT32_(0x7) << PFW_IFT_ECCSYN_CTLSTAT_Pos)        /* (PFW_IFT_ECCSYN)  Mask */
#define PFW_IFT_ECCSYN_CTLSTAT(value)         (PFW_IFT_ECCSYN_CTLSTAT_Msk & (_UINT32_(value) << PFW_IFT_ECCSYN_CTLSTAT_Pos)) /* Assigment of value for CTLSTAT in the PFW_IFT_ECCSYN register */
#define PFW_IFT_ECCSYN_PERR0_Pos              _UINT32_(28)                                         /* (PFW_IFT_ECCSYN)  Position */
#define PFW_IFT_ECCSYN_PERR0_Msk              (_UINT32_(0x1) << PFW_IFT_ECCSYN_PERR0_Pos)          /* (PFW_IFT_ECCSYN)  Mask */
#define PFW_IFT_ECCSYN_PERR0(value)           (PFW_IFT_ECCSYN_PERR0_Msk & (_UINT32_(value) << PFW_IFT_ECCSYN_PERR0_Pos)) /* Assigment of value for PERR0 in the PFW_IFT_ECCSYN register */
#define PFW_IFT_ECCSYN_PERR1_Pos              _UINT32_(29)                                         /* (PFW_IFT_ECCSYN)  Position */
#define PFW_IFT_ECCSYN_PERR1_Msk              (_UINT32_(0x1) << PFW_IFT_ECCSYN_PERR1_Pos)          /* (PFW_IFT_ECCSYN)  Mask */
#define PFW_IFT_ECCSYN_PERR1(value)           (PFW_IFT_ECCSYN_PERR1_Msk & (_UINT32_(value) << PFW_IFT_ECCSYN_PERR1_Pos)) /* Assigment of value for PERR1 in the PFW_IFT_ECCSYN register */
#define PFW_IFT_ECCSYN_PERR2_Pos              _UINT32_(30)                                         /* (PFW_IFT_ECCSYN)  Position */
#define PFW_IFT_ECCSYN_PERR2_Msk              (_UINT32_(0x1) << PFW_IFT_ECCSYN_PERR2_Pos)          /* (PFW_IFT_ECCSYN)  Mask */
#define PFW_IFT_ECCSYN_PERR2(value)           (PFW_IFT_ECCSYN_PERR2_Msk & (_UINT32_(value) << PFW_IFT_ECCSYN_PERR2_Pos)) /* Assigment of value for PERR2 in the PFW_IFT_ECCSYN register */
#define PFW_IFT_ECCSYN_PERR3_Pos              _UINT32_(31)                                         /* (PFW_IFT_ECCSYN)  Position */
#define PFW_IFT_ECCSYN_PERR3_Msk              (_UINT32_(0x1) << PFW_IFT_ECCSYN_PERR3_Pos)          /* (PFW_IFT_ECCSYN)  Mask */
#define PFW_IFT_ECCSYN_PERR3(value)           (PFW_IFT_ECCSYN_PERR3_Msk & (_UINT32_(value) << PFW_IFT_ECCSYN_PERR3_Pos)) /* Assigment of value for PERR3 in the PFW_IFT_ECCSYN register */
#define PFW_IFT_ECCSYN_Msk                    _UINT32_(0xF70781FF)                                 /* (PFW_IFT_ECCSYN) Register Mask  */

#define PFW_IFT_ECCSYN_PERR_Pos               _UINT32_(28)                                         /* (PFW_IFT_ECCSYN Position)  */
#define PFW_IFT_ECCSYN_PERR_Msk               (_UINT32_(0xF) << PFW_IFT_ECCSYN_PERR_Pos)           /* (PFW_IFT_ECCSYN Mask) PERR */
#define PFW_IFT_ECCSYN_PERR(value)            (PFW_IFT_ECCSYN_PERR_Msk & (_UINT32_(value) << PFW_IFT_ECCSYN_PERR_Pos)) 

/* -------- PFW_DFT_VALCON : (PFW Offset: 0xF0) (R/W 32)  -------- */
#define PFW_DFT_VALCON_RESETVALUE             _UINT32_(0x00)                                       /*  (PFW_DFT_VALCON)   Reset Value */

#define PFW_DFT_VALCON_VAL_ON_Pos             _UINT32_(15)                                         /* (PFW_DFT_VALCON)  Position */
#define PFW_DFT_VALCON_VAL_ON_Msk             (_UINT32_(0x1) << PFW_DFT_VALCON_VAL_ON_Pos)         /* (PFW_DFT_VALCON)  Mask */
#define PFW_DFT_VALCON_VAL_ON(value)          (PFW_DFT_VALCON_VAL_ON_Msk & (_UINT32_(value) << PFW_DFT_VALCON_VAL_ON_Pos)) /* Assigment of value for VAL_ON in the PFW_DFT_VALCON register */
#define PFW_DFT_VALCON_Msk                    _UINT32_(0x00008000)                                 /* (PFW_DFT_VALCON) Register Mask  */


/* -------- PFW_DFT_VALP1RR01 : (PFW Offset: 0x100) (R/W 32)  -------- */
#define PFW_DFT_VALP1RR01_RESETVALUE          _UINT32_(0x00)                                       /*  (PFW_DFT_VALP1RR01)   Reset Value */

